Revit 2026 API

# CableTrayConduitBaseIsValidEndPoints Method

---

Identifies if two end points are valid.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidEndPoints(
	XYZ startPoint,
	XYZ endPoint
)
```
```vb
Public Shared Function IsValidEndPoints (
	startPoint As XYZ,
	endPoint As XYZ
) As Boolean
```
```cpp
public:
static bool IsValidEndPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
```
```fsharp
static member IsValidEndPoints :
        startPoint : XYZ *
        endPoint : XYZ -> bool
```

#### Parameters

startPoint XYZ
     The start point of the location line.
endPoint XYZ
     The end point of the location line.

#### Return Value

Boolean True if the two end points are valid, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The two points should not be too close.

#### Reference

CableTrayConduitBase Class

Autodesk.Revit.DB.Electrical Namespace